el/myinit.org
#+STARTUP: overview
* repo
  #+BEGIN_SRC emacs-lisp
    (add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)
  #+END_SRC
* interface tweaks
* sub-config file path
  add customize load path

  #+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/el")
  #+END_SRC
* some useful func
** 打开我的配置文件
   #+BEGIN_SRC emacs-lisp
  (defun open-my-init-file()
    (interactive)
    (find-file "~/.emacs.d/el/myinit.el"))
   #+END_SRC
** about occur and i dont understand
   #+BEGIN_SRC emacs-lisp
     (defun occur-dwim ()
       "Call `occur' with a sane default."
       (interactive)
       (push (if (region-active-p)
		 (buffer-substring-no-properties
		  (region-beginning)
		  (region-end))
	       (let ((sym (thing-at-point 'symbol)))
		 (when (stringp sym)
		   (regexp-quote sym))))
	     regexp-history)
       (call-interactively 'occur))
   #+END_SRC 
* try
* which key
* Org mode
  用org替换自带的org-mode
  reveal.js需要org
  #+BEGIN_SRC emacs-lisp
    (use-package org
      )

  #+END_SRC
* Ace windows for easy window switching
* Swiper / Ivy / Counsel
* Avy - navigate by searching for a letter on the screen and jumping to it
* Autocomplete
* Themes
* Reveal.js 
  学来做ppt
  #+BEGIN_SRC emacs-lisp
    (use-package ox-reveal
      :ensure ox-reveal)

    (setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
    (setq org-reveal-mathjax t)

    (use-package htmlize
      :ensure t)
  #+END_SRC
